nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxc162/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.h
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORT0_2 (number 40), P0_2/J16[6]/U6[4]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORT0_3 (number 41), P0_3/J16[8]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORT2_3 (number 13), P2_3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_RED_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_RED_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITLEDSPINS_LED_RED_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_LED_RED_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_LED_RED_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_RED_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_RED_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT2_7 (number 15), P2_7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_GREEN_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_GREEN_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITLEDSPINS_LED_GREEN_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_LED_GREEN_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_LED_GREEN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_GREEN_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_GREEN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_10 (number 3), P1_10
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_BLUE_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_BLUE_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITLEDSPINS_LED_BLUE_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_LED_BLUE_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_LED_BLUE_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_BLUE_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_BLUE_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*! @name PORT3_14 (number 28), P3_14/TP13/SW2[3]/SW2[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW2_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW2_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_29 (number 25), P3_29/J16[7]/TP14/SW3[3]/SW3[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW3_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN 29U              /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW3_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW3_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

#define PCR_IBE_ibe0 0x00u         /*!<@brief Input Buffer Enable: Disables */
#define PORT1_PCR3_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT0_6 (number 42), P0_6/J4[2]/J2[7]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADCPINS_VOLT_DCB_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADCPINS_VOLT_DCB_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_VOLT_DCB_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT1_0 (number 45), P1_0/J4[10]/J6[6]/J7[3]/J2[5]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADCPINS_CUR_C_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADCPINS_CUR_C_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_CUR_C_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_3 (number 48), P1_3/J6[1]/J2[3]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADCPINS_CUR_B_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADCPINS_CUR_B_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_CUR_B_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_16 (number 18), P2_16/J1[6]/J2[1]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADCPINS_CUR_A_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADCPINS_CUR_A_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_CUR_A_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADCPins(void);

#define PCR_IBE_ibe0 0x00u         /*!<@brief Input Buffer Enable: Disables */
#define PORT2_PCR2_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCMPPins(void);

#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PORT3_PCR0_MUX_mux101 0x05u /*!<@brief Pin Multiplex Control: Alternative 5 (chip-specific) */

/*! @name PORT3_0 (number 36), P3_0/J1[12]/J3[15]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWMPINS_PWM0_A0_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWMPINS_PWM0_A0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPWMPINS_PWM0_A0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_1 (number 35), P3_1/J1[14]/J3[13]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWMPINS_PWM0_B0_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWMPINS_PWM0_B0_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPWMPINS_PWM0_B0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_8 (number 34), P3_8/J2[8]/J3[11]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWMPINS_PWM0_A1_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWMPINS_PWM0_A1_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPWMPINS_PWM0_A1_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_9 (number 33), P3_9/J2[10]/J3[9]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWMPINS_PWM0_B1_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWMPINS_PWM0_B1_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPWMPINS_PWM0_B1_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_10 (number 32), P3_10/J2[12]/J3[7]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWMPINS_PWM0_A2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWMPINS_PWM0_A2_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPWMPINS_PWM0_A2_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_11 (number 31), P3_11/J2[6]/J3[5]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWMPINS_PWM0_B2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWMPINS_PWM0_B2_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPWMPINS_PWM0_B2_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWMPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
